Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/irish_citizenship/becoming_an_irish_citizen_through_marriage.html.txt.tmx
Source language: en
Languages: ga

source: Becoming an Irish citizen through marriage or civil partnership
ga: Ag éirí i do shaoránach Éireannach trí phósadh nó pháirtnéireacht sibhialta

source: If you are a foreign national who is the spouse or civil partner of an Irish citizen, you may be able to become an Irish citizen if you meet certain conditions
ga: Más náisiúnach eachtrach tú atá pósta nó i bpáirtnéireacht sibhialta le saoránach Éireannach b’fhéidir go mbeidh tú i dteideal éirí i do shaoránach Éireannach má shásaíonn tú coinníollacha áirithe

source: Foreign nationals married to or in a civil partnership with Irish citizens can apply for citizenship through naturalisation
ga: Is féidir le náisiúnach eachtrach atá pósta nó i bpáirtnéireacht sibhialta le saoránach Éireannach iarratas ar shaoránacht Éireannach trí eadóirseacht a dhéanamh

source: The application process is the same as for foreign nationals who are not the spouses or civil partners of Irish citizens but there are more favourable residence requirements
ga: Tá an próiseas iarratais an próiseas céanna a bhaineann le náisiúnach eachtrach nach bhfuil pósta nó i bpáirtnéireacht sibhialta le saoránach Éireannach ach tá na riachtanais chónaithe níos fearr

source: The Minister for Justice and Equality has discretion to grant or refuse your application
ga: Tá discréid iomlán ag an Aire Dlí agus Cirt agus Comhionannais chun d’iarratas a cheadú nó a dhiúltú

source: You must use the current versions of the application forms on the INIS website - see 'How to apply' below
ga: Caithfidh tú leagan reatha na foirmeacha iarratais ar fáil ar an suíomh gréasáin SEIS a úsáid – féach ‘Conas iarratas a dhéanamh’ thíos

source: There is an application fee of €175 - see 'Rates' below
ga: Tá táille €175 – féach ‘Rátaí’ thíos

source: Public Services Card: From 19 September 2016, if you are applying for naturalisation and you are resident in the State, you must be registered with the Department of Social Protection for a Public Services Card
ga: Cárta Seirbhísí Poiblí: Ó 19 Meán Fómhair 2016, má dhéanann tú iarratas ar eadóirseacht agus tá tú i do chónaí sa Stát, ní mór duit bheith cláraithe leis an Roinn Coimirce Sóisialaí do Chárta Seirbhísí Poiblí

source: If you are the spouse or civil partner of an Irish citizen who is applying for Irish citizenship, you must meet the following conditions:
ga: Má ta tá tú pósta nó i bpáirtnéireacht sibhialta le saoránach Éireannach agus tá tú ag déanamh iarratas ar shaoránacht Éireannach caithfidh tú na coinníollacha ar leanúint chomhall:

source: • You must be married to or in a recognised civil partnership* with the Irish citizen for at least 3 years
ga: • Caithfidh tú bheith pósta nó i bpáirtnéireacht sibhialta* leis an saoránach Éireannach 3 bliana anuas ar a laghad

source: • You must have had a period of 1 year's continuous reckonable residence - see below - in the island of Ireland immediately before the date of your application, and during the 4 years preceding that, have had a total reckonable residence in the island of Ireland amounting to 2 years
ga: • Caithfidh tú a bheith i do chónaí in oileán na hÉireann ar feadh 1 bliana leanúnaí de chónaí inghlactha - féach thíos - díreach roimh dháta d'iarratais agus, cónaí inghlactha iomlán in oileán na hÉireann 2 bliana a bheith agat i rith na 4 bliana roimhe sin

source: Altogether you must have a total of 3 years reckonable residence out of the last 5 years
ga: San iomlán, caithfidh tú 3 bliana de chónaí ináirithe a bheith agat sna 5 bliana seo caite

source: • Your marriage or civil partnership must be recognised as valid under Irish law
ga: • Caithfidh do phósadh nó pháirtnéireacht sibhialta a bheith aitheanta a bheith bailí faoi dhlí na hÉireann

source: • You and your spouse or civil partner must be living together as husband and wife or civil partners
ga: • Caithfidh tú féin agus do chéile nó páirtnéir sibhialta a bheith in bhur gcónaí mar fhear céile is bean chéile nó páirtnéirí sibhialta

source: • You must be of full age, good character and intend to continue to live on the island of Ireland
ga: • Caithfidh tú bheith 18 nó os a chionn, dea-cháil a bheith ort agus dea-rún a bheith agat leanúint ort bheith i do chónaí in oileán na hÉireann

source: • You must have made a declaration of fidelity to the nation and loyalty to the State
ga: • Caithfidh tú dearbhú dílseachta a dhéanamh don náisiún agus don Stát

source: *Foreign relationships registered outside Ireland were only recognised by the State on 13 January 2011 when the Civil Partnership and Certain Rights and Obligations of Cohabitants Act 2010 came into force
ga: Níor aithin an Stát *Caidreamh eachtrach a cláraíodh lasmuigh d’Éirinn ach ón 13 Eanáir 2011 i leith, nuair a tháinig an tAcht um Pháirtnéireacht Shibhialta agus um Chearta agus Oibleagáidí Áirithe de chuid Comhchónaitheoirí 2010 i bhfeidhm

source: However, under the Marriage Act 2015, it is now possible for same-sex couples to become legally married and you can no longer register a civil partnership in Ireland
ga: Áfach, faoin Acht um Pósadh 2015, is féidir le lanúineacha chomhghnéis bheith pósadh go dlíthiúil agus ní féidir leat páirtnéireacht sibhialta a chlárú in Éirinn

source: Partnerships registered abroad after 16 November 2015 are not recognised as civil partnerships in Ireland
ga: Ní aithnítear páirtnéireachtaí atá cláraithe thar lear i ndiaidh 16 Samhain 2015, mar páirtnéireachtaí sibhialta in Éirinn

source: Certain periods of residence do not count for the purpose of reckonable residence, for example, periods when you did not have permission to remain in Ireland, or you had permission that was for study purposes or while having a claim for asylum examined
ga: B'fhéidir go mbeidh roinnt tréimhsí cónaithe fágtha as an áireamh le haghaidh cónaithe inghlactha, mar shampla, tréimhsí nach raibh cead fanachta in Éirinn agat, nó bhí tú anseo le víosa mhic léinn, nó bhíothas ag scrúdú iarratais ar thearmann

source: You can use the online residency calculator on the INIS website to check if you meet the naturalisation residency conditions
ga: Is féidir an t-áireamhán cónaitheachta ar líne sa suíomh gréasáin SEIS a úsáid chun seiceáil an bhfuil na coinníollacha eadóirseachta cónaitheachta sásta

source: If you have previously been married and divorced
ga: Má bhí tú pósta roimhe seo agus colscartha

source: You can only claim citizenship by marriage or civil partnership if your current marriage or civil partnership is valid under Irish law
ga: Ní féidir leat saoránacht trí phósadh nó pháirtnéireacht sibhialta a éileamh ach amháin má tá do phósadh nó páirtnéireacht sibhialta reatha bailí

source: Processing your application for citizenship
ga: Conas a phróiseáltar d'iarratas ar shaoránacht

source: You will be informed by registered post when the decision is made on your application
ga: Cuirfear in iúl duit trí phost cláraithe chomh luath agus atá cinneadh déanta maidir le d'iarratas

source: Generally most applications will be processed within 6 months
ga: De ghnáth, beidh an chuid is mó iarratais próiseáilte laistigh 6 mhí

source: If your application is approved, the letter notifying you of this decision will contain instructions regarding the final procedures that must be completed before the certificate of naturalisation can be issued
ga: Má éiríonn le d'iarratas, beidh eolas sa litir a chuirfidh an cinneadh seo in iúl duit faoin bpróiseas deireanach a chaithfear a chríochnú sula n-eisítear an teastas eadóirseachta

source: When you submit the required documentation and certification fee, you will be invited to a citizenship ceremony at which you will be granted your certificate of naturalisation
ga: Nuair cuireann tú na cáipéisí riachtanacha agus táille dheimhniúcháin isteach, tabharfar cuireadh duit ar shearmanas saoránachta agus tabharfar duit do theastas eadóirseachta

source: You can apply for an Irish passport following the confirmation of your Irish citizenship and the receipt of your citizenship certificate
ga: Tá tú i do shaoránach Éireannach ó dháta eisiúint an teastais anuas agus is féidir leat iarratas ar phas Éireannach a dhéanamh ag am ar bith tar éis an dáta sin

source: The fee for an application for naturalisation is €175
ga: Is é €175 an táille do gach iarratas ar eadóirseacht

source: When the certificate of naturalisation is issued you pay a fee of €950
ga: Nuair eisítear an teastas eadóirseachta, íocann tú táille €950

source: You must use the current versions of the application forms on the INIS website
ga: Caithfidh tú leagan reatha na foirmeacha iarratais ar fáil ar an suíomh gréasáin SEIÉ a úsáid

source: You apply using Form 8 (pdf) which is available from the Irish Naturalisation and Immigration Service (INIS)
ga: Is féidir leat iarratas a dhéanamh ar an bhfoirm 8 (pdf) atá ar fáil ón tSeirbhís Eadóirseachta agus Inimirce na hÉireann (SEIÉ)

source: The supporting documents required include evidence of your identity and nationality (birth certificate and passport)
ga: I measc na gcáipéisí eile atá ag teastáil, tá fianaise d'aitheantais agus do náisiúnachta (teastas breithe agus pas)

source: From 19 September 2016, if you are applying for naturalisation and you are resident in the State, you must be registered for a Public Services Card
ga: Ó 19 Meán Fómhair 2016, má dhéanann tú iarratas ar eadóirseacht agus tá tú i do chónaí sa Stát, ní mór duit bheith cláraithe do Chárta Seirbhísí Poiblí

source: You will also need to produce documents relating to your status and the duration of your stay in the State, for example, your Certificate of Registration, declaration of refugee status
ga: Caithfidh tú freisin cáipéisí a thaispeáint maidir le do stádas agus faoin tréimhse a bheidh tú ag stopadh sa Stát m.sh.Teastas Clárúcháin nó ráiteas faoi stádas dídeanaí

source: Spouse or civil partner of an Irish citizen
ga: Pósta le nó páirtnéir sibhialta de saoránach Éireannach

source: As your application for naturalisation is based on your marriage to or civil partnership with an Irish citizen, you will need to produce the documents needed to show your spouse’s or civil partner's status and evidence of your marital or civil partner status (for example, birth or naturalisation certificate of Irish spouse, marriage or civil registration certificate)
ga: Mar tá d'iarratas ar eadóirseacht bunaithe ar do phósadh nó do páirtnéireacht sibhialta le saoránach Éireannach caithfidh tú freisin cáipéisí a thaispeáint maidir le do stádas do chéile nó do pháirtnéir sibhialta agus fianaise do stádas pósta nó páirtnéireachta sibhialta (mar shampla, teastas breithe nó eadóirseachta ag do chéile, teastas pósta)

source: In the application form your spouse or civil partner must complete a sworn affidavit that you are living together as husband and wife or civil partners
ga: San fhoirm iarratais caithfidh do chéile nó do pháirtnéir sibhialta mionnscríbhinn ó fhinné go bhfuil sibh in bhur gcónaí mar fhear céile is bean chéile nó mar pháirtnéirí sibhialta a chomhlánú

source: As well as these documents, you must produce documents relevant to your financial and employment status (payslips for the previous 3 months, bank statements for the previous 3 months) and confirmation of your income tax situation
ga: Chomh maith leis na cáipéisí seo, caithfidh tú cáipéisí a thaispeáint maidir le do stádas airgeadais agus fostaíochta (duillíní pá le haghaidh na 3 mhí dheireanach, ráitis bhainc le haghaidh na 3 mhí a chuaigh thart) agus dearbhú faoi do staid maidir le cáin ioncaim

source: You should only send copies of the above documents with your application form
ga: Níor cheart ach cóipeanna amháin de na rudaí seo a sheoladh in éineacht leis d'fhoirm iarratais

source: The copies of birth, marriage, civil partnership and divorce certificates must be certified documents
ga: Caithfidh na cóipeanna de na teastais bhreithe, pósta, páirtnéireachta sibhialta agus colscartha bheith cóipeanna deimhnithe

source: You will be expected to produce the original documents for inspection at a later stage during the examination of your application
ga: Beidh dúil go mbeidh sé i do chumas na bundindiúirí a thaispeáint níos faide anonn nuair atá ag scrúdú d'iarratais

source: The information in your application form will be checked against the supporting documentation and any inaccuracy will lead to delays in ruling on your application
ga: Seiceálfar an t-eolas i d'fhoirm iarratais le hais na cáipéise lena cois agus beidh moill ann mar thoradh ar aon mhíchruinneas maidir le cinneadh a thabhairt ar d'iarratas

source: You should not sign the form until you are in the presence of the person who must witness you signing it
ga: Níor cheart ainm a chur leis an bhfoirm go dtí go mbeidh tú i láthair finné

source: The application form contains instructions about who is eligible to be a witness
ga: Tá eolas ar an bhfoirm iarratais maidir le cé atá i dteideal a bheith mar fhinné

source: New applications should be sent to Citizenship Applications, Irish Naturalisation and Immigration Service, PO Box 73, Tipperary Town
ga: Ní mór d’iarratais nua a sheol chuig Iarratais ar Shaoránacht, Seirbhís Eadóirseachta agus Inimirce na hÉireann, Bosca Poist 73, Baile Thiobraid Árann

source: Note: this address is only for lodging new adult applications
ga: Nóta: ní bhaineann an seoladh ach amháin le hiarratais nua le haghaidh duine fásta
